#!/usr/bin/perl

if($ARGV[0] =~ "help"){
	print "help\n";
	print "-kamikaze\n";
	print "-mutsuki\n";
	print "-fubuki\n";
	print "-hatsuharu\n";
	print "-shiratsuyu\n";
	print "-asashio\n";
	print "-kagerou\n";
	print "-yuugumo\n";
	print "-akizuki\n";
	print "-shimakaze\n";
	print "-matsu\n";
}
elsif($ARGV[0] =~ "kamikaze"){
	print "
01　神風
02　朝風
03　春風
04　松風
05　旗風
06　(追風)（おいて）
07　(疾風)（はやて）
08　(朝凪)（あさなぎ）
09　(夕凪)\n";
}
elsif($ARGV[0] =~ "mutsuki"){
	print "
01　睦月
02　如月
03　弥生
04　卯月
05　皐月
06　水無月
07　文月
08　長月
09　菊月
10　三日月
11　望月
12　(夕月)\n";
}
elsif($ARGV[0] =~ "fubuki"){
	print "
01　吹雪
02　白雪
03　初雪
04　深雪
05　叢雲
06　(東雲)
07　(薄雲)
08　(白雲)
09　磯波
10　浦波
11　綾波
12　敷波
13　(朝霧)
14　(夕霧)
15　天霧
16　狭霧
17　朧
18　曙
19　漣
20　潮
21　暁
22　響
23　雷
24　電\n";
}
elsif($ARGV[0] =~ "hatsuharu"){
	print "
01　初春
02　子日
03　若葉
04　初霜
05　(有明)
06　(夕暮)\n";
}

elsif($ARGV[0] =~ "shiratsuyu"){
	print "
01　白露
02　時雨
03　村雨
04　夕立
05　春雨
06　五月雨
07　海風
08　山風
09　江風
10　涼風\n";
}

elsif($ARGV[0] =~ "asashio"){
	print "
01　朝潮
02　大潮
03　満潮
04　荒潮
05　朝雲
06　山雲
07　(夏雲)
08　(峯雲)
09　霞
10　霰\n";
}

elsif($ARGV[0] =~ "kagerou"){
	print "
01　陽炎
02　不知火
03　黒潮
04　親潮
05　(早潮)
06　(夏潮)
07　初風
08　雪風
09　天津風
10　時津風
11　浦風
12　磯風
13　浜風
14　谷風
15　野分
16　嵐
17　萩風
18　舞風
19　秋雲\n";
}

elsif($ARGV[0] =~ "yuugumo"){
	print "
01　夕雲
02　巻雲
03　風雲
04　長波
05　巻波
06　高波
07　(大波)
08　(清波)
09　(玉波)
10　(涼波)
11　藤波
12　(早波)
13　浜波 2018/2/16 実装
14　沖波
15　岸波 2018/9/9 実装
16　朝霜
17　早霜
18　(秋霜)
19　清霜\n";
}

elsif($ARGV[0] =~ "akizuki"){
	print "
01　秋月
02　照月
03　涼月
04　初月
05　(新月)
06　(若月)
07　(霜月)
08　(冬月)
09　(春月)
10　(宵月)
11　(夏月)
12　(満月)
13　(花月)\n";
}

elsif($ARGV[0] =~ "shimakaze"){
	print "
01　島風\n";
}

elsif($ARGV[0] =~ "matsu"){
	print "
01　松
02　竹
03　梅
04　桃
05　桑
06　桐
07　杉
08　槇（まき）
09　樅（もみ）
10　樫（かし）
11　榧（かや）
12　楢（なら）
13　櫻
14　柳
15　椿
16　檜（ひのき）
17　楓（かえで）
18　欅（けやき）	
19　橘
20　柿
21　樺（かば）
22　蔦
23　萩（はぎ）
24　菫（すみれ）
25　楠（くすのき）
26　初櫻（はつざくら）
27　楡（にれ）
28　梨（なし）
29　椎（しい）
30　榎（えのき）
31　雄竹（をだけ）
32　初梅\n";
}

elsif($ARGV[0] =~ "yobi"){
	print "
	 
 	";
}
